#include "BST.h"

#include <iostream>

int main()
{
	BST<int> tree;
	
	/*tree.insert(5);
	cout << "size : "<<tree.Size() << endl;
	tree.insert(2);
	cout << "size : " << tree.Size() << endl;
	tree.insert(8);
	cout << "size : " << tree.Size() << endl;
	tree.insert(-10);
	cout << "size : " << tree.Size() << endl;
	tree.insert(3);
	cout << "size : " << tree.Size() << endl;
	cout << "TREE" << endl;
	tree.printTree();
	cout << endl;
	tree.remove(8);
	cout << "size : " << tree.Size() << endl;


	cout << "TREE" << endl;
	tree.printTree();


	tree.clear();
	cout << "size : " << tree.Size() << endl;
	tree.printTree();*/
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
